# Создайте функцию, которая принимает на вход параметр num и печатает этот параметр в консоль.

num = [0, 1, 2, 3, 4, 5, 6, 7, 8]

def print_greeting1(num):
    print (num)

print_greeting1(8)
print_greeting1(8)
print_greeting1(0)
print_greeting1(0)
print_greeting1(5)
print_greeting1(5)
print_greeting1(5)
print_greeting1(3)
print_greeting1(5)
print_greeting1(3)
print_greeting1(5)

print_greeting1(88005553535)