# Создайте по одной функции на каждое действие (всего 10 функций):
#     1. Вывести в консоль 1
#     2. Вывести в консоль 2
#     3. Вывести в консоль 3
#     4. Вывести в консоль 4
#     5. Вывести в консоль 5
#     6. Вывести в консоль 6
#     7. Вывести в консоль 7
#     8. Вывести в консоль 8
#     9. Вывести в консоль 9
#     10. Вывести в консоль 0

# def print_greeting1():
#     print ("Вывести в консоль 1")

# def print_greeting2():
#     print ("Вывести в консоль 2")

# def print_greeting3():
#     print ("Вывести в консоль 3")

# def print_greeting4():
#     print ("Вывести в консоль 4")

# def print_greeting5():
#     print ("Вывести в консоль 5")

# def print_greeting6():
#     print ("Вывести в консоль 6")

# def print_greeting7():
#     print ("Вывести в консоль 7")

# def print_greeting8():
#     print ("Вывести в консоль 8")

# def print_greeting0():
#     print ("Вывести в консоль 0")

# Вызовите объявленные функции в таком порядке, чтобы на экране отобразился номер 88005553535.

# print_greeting8()
# print_greeting8()
# print_greeting0()
# print_greeting0()
# print_greeting5()
# print_greeting5()
# print_greeting5()
# print_greeting3()
# print_greeting5()
# print_greeting3()
# print_greeting5()

# Или

def print_1():
  print(88005553535, end='') 

print_1()