# **Задание 10. Банковское приложение***

# 1. Создайте файл lesson_2_task_10.py.
# 2. Дано**:** пользователь делает вклад в размере Х рублей сроком на Y лет под 10% годовых (каждый год размер его вклада увеличивается на 10%, эти деньги прибавляются к сумме вклада, и на них в следующем году тоже будут проценты).
# 3. Задача: написать функцию bank, принимающую аргументы X и Y и возвращающую сумму, которая будет на счету пользователя спустя Y лет.

def bank(X, Y):
    # Процентная ставка
    rate = 0.10
    # Расчет суммы вклада с учетом сложных процентов
    final_amount = X * ((1 + rate) * Y)
    return final_amount

# Пример использования функции
initial_amount = int(input("Введите сумму вклада: "))
years = int(input("Введите срок вклада в годах: "))

final_amount = bank(initial_amount, years)
print(f"Сумма на счету после {years} лет будет: {final_amount} рублей")